app/controllers/debts_controller.rb

  def index
    @debts = Debt.all
---
SELECT * FROM "debts"

  def show
    @debt = Debt.find(params[:id])
---
SELECT * FROM "debts" WHERE ("debts"."id" = 1)

  def edit
    @debt = Debt.find(params[:id])
---
SELECT * FROM "debts" WHERE ("debts"."id" = 1)

  def create
    @debt = Debt.new(params[:debt])

    respond_to do |format|
      if @debt.save
---
INSERT INTO "debts" ("name", "created_at", "updated_at", "amount") VALUES('Macy''s', '2010-09-05 18:28:42', '2010-09-05 18:28:42', 2.0)

  def update
    @debt = Debt.find(params[:id])

    respond_to do |format|
      if @debt.update_attributes(params[:debt])
---
SELECT * FROM "debts" WHERE ("debts"."id" = 1)
UPDATE "debts" SET "updated_at" = '2010-09-05 18:28:54', "amount" = 2234.67 WHERE "id" = 1