app/controllers/payments_controller.rb

SELECT * FROM "payments"
---
  def index
    @payments = Payment.all.reverse